In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [6]:
consumption = pd.read_csv('long_data_.csv')

In [7]:
consumption

          States Regions   latitude  longitude                Dates  Usage
0         Punjab      NR  31.519974  75.980003  02/01/2019 00:00:00  119.9
1        Haryana      NR  28.450006  77.019991  02/01/2019 00:00:00  130.3
2      Rajasthan      NR  26.449999  74.639981  02/01/2019 00:00:00  234.1
3          Delhi      NR  28.669993  77.230004  02/01/2019 00:00:00   85.8
4             UP      NR  27.599981  78.050006  02/01/2019 00:00:00  313.9
...          ...     ...        ...        ...                  ...    ...
16594    Manipur     NER  24.799971  93.950017  05/12/2020 00:00:00    2.5
16595  Meghalaya     NER  25.570492  91.880014  05/12/2020 00:00:00    5.8
16596    Mizoram     NER  23.710399  92.720015  05/12/2020 00:00:00    1.6
16597   Nagaland     NER  25.666998  94.116570  05/12/2020 00:00:00    2.1
16598    Tripura     NER  23.835404  91.279999  05/12/2020 00:00:00    3.3

[16599 rows x 6 columns]

In [8]:
consumption.head()

      States Regions   latitude  longitude                Dates  Usage
0     Punjab      NR  31.519974  75.980003  02/01/2019 00:00:00  119.9
1    Haryana      NR  28.450006  77.019991  02/01/2019 00:00:00  130.3
2  Rajasthan      NR  26.449999  74.639981  02/01/2019 00:00:00  234.1
3      Delhi      NR  28.669993  77.230004  02/01/2019 00:00:00   85.8
4         UP      NR  27.599981  78.050006  02/01/2019 00:00:00  313.9

In [9]:
consumption.shape

(16599, 6)

In [11]:
consumption.columns

Index(['States', 'Regions', 'latitude', 'longitude', 'Dates', 'Usage'], dtype='object')

In [12]:
consumption.dtypes

States        object
Regions       object
latitude     float64
longitude    float64
Dates         object
Usage        float64
dtype: object

In [15]:
consumption['Dates']=pd.to_datetime(consumption['Dates'])

In [16]:
consumption['Dates']

0       2019-02-01
1       2019-02-01
2       2019-02-01
3       2019-02-01
4       2019-02-01
           ...
16594   2020-05-12
16595   2020-05-12
16596   2020-05-12
16597   2020-05-12
16598   2020-05-12
Name: Dates, Length: 16599, dtype: datetime64[ns]

In [17]:
consumption.set_index('Dates',inplace=True)

In [18]:
consumption.head()

               States Regions   latitude  longitude  Usage
Dates
2019-02-01     Punjab      NR  31.519974  75.980003  119.9
2019-02-01    Haryana      NR  28.450006  77.019991  130.3
2019-02-01  Rajasthan      NR  26.449999  74.639981  234.1
2019-02-01      Delhi      NR  28.669993  77.230004   85.8
2019-02-01         UP      NR  27.599981  78.050006  313.9

In [19]:
consumption.describe()

           latitude     longitude         Usage
count  16599.000000  16599.000000  16599.000000
mean      23.178220     81.794533    103.001862
std        6.146575      7.258429    116.044056
min        8.900373     71.192400      0.300000
25%       19.820430     76.569993      6.700000
50%       23.835404     78.570026     64.400000
75%       27.333330     88.329947    173.900000
max       33.450000     94.216667    522.100000

In [20]:
consumption.isnull().sum()

States       0
Regions      0
latitude     0
longitude    0
Usage        0
dtype: int64

In [21]:
consumption['Usage']

Dates
2019-02-01    119.9
2019-02-01    130.3
2019-02-01    234.1
2019-02-01     85.8
2019-02-01    313.9
              ...
2020-05-12      2.5
2020-05-12      5.8
2020-05-12      1.6
2020-05-12      2.1
2020-05-12      3.3
Name: Usage, Length: 16599, dtype: float64

In [22]:
from scipy import stats
mode= stats.mode(consumption['Usage'])

In [23]:
print(mode)

ModeResult(mode=array([2.2]), count=array([328]))

In [24]:
consumption.corr()

           latitude  longitude     Usage
latitude   1.000000   0.180809 -0.253823
longitude  0.180809   1.000000 -0.525028
Usage     -0.253823  -0.525028  1.000000

In [25]:
consumption.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 16599 entries, 2019-02-01 to 2020-05-12
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   States     16599 non-null  object
 1   Regions    16599 non-null  object
 2   latitude   16599 non-null  float64
 3   longitude  16599 non-null  float64
 4   Usage      16599 non-null  float64
dtypes: float64(3), object(2)
memory usage: 778.1+ KB

In [27]:
df = pd.read_csv('dataset_tk.csv')

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 503 entries, 0 to 502
Data columns (total 34 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         503 non-null    object
 1   Punjab             503 non-null    float64
 2   Haryana            503 non-null    float64
 3   Rajasthan          503 non-null    float64
 4   Delhi              503 non-null    float64
 5   UP                 503 non-null    float64
 6   Uttarakhand        503 non-null    float64
 7   HP                 503 non-null    float64
 8   J&K                503 non-null    float64
 9   Chandigarh         503 non-null    float64
 10  Chhattisgarh       503 non-null    float64
 11  Gujarat            503 non-null    float64
 12  MP                 503 non-null    float64
 13  Maharashtra        503 non-null    float64
 14  Goa                503 non-null    float64
 15  DNH                503 non-null    float64
 16  Andhra Pradesh     503 non-null    float64
 17  Telangana          503 non-null    float64
 18  Karnataka          503 non-null    float64
 19  Kerala             503 non-null    float64
 20  Tamil Nadu         503 non-null    float64
 21  Pondy              503 non-null    float64
 22  Bihar              503 non-null    float64
 23  Jharkhand          503 non-null    float64
 24  Odisha             503 non-null    float64
 25  West Bengal        503 non-null    float64
 26  Sikkim             503 non-null    float64
 27  Arunachal Pradesh  503 non-null    float64
 28  Assam              503 non-null    float64
 29  Manipur            503 non-null    float64
 30  Meghalaya          503 non-null    float64
 31  Mizoram            503 non-null    float64
 32  Nagaland           503 non-null    float64
 33  Tripura            503 non-null    float64
dtypes: float64(33), object(1)
memory usage: 133.7+ KB

In [31]:
df['Date'] = pd.to_datetime(df.Date, dayfirst=True)

AttributeError: 'DataFrame' object has no attribute 'Date'